tutorials/incompressible/simpleFoam/mixingPlaneDomADomB/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii; 	;
    class       dictionary; 	;
    object      decomposeParDict; 	;
}
numberOfSubdomains 4;

method manual; 	//metis; //simple;

globalFaceZones (
    ggi1DomBZone
    ggi1DomAZone
    ggi2DomBZone
    ggi2DomAZone
); 	

manualCoeffs
{
  dataFile "manualDecomp.txt";
} 	

simpleCoeffs
{
  n (1 4 1);
  delta 0.001; 	
} 	

distributed no; 	

roots
  (
  ); 	

